app/views/people/_person.html.haml

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
%p
  = link_to 'Delete person', [person.group, person], method: :delete, data: { confirm: 'Are you sure?' }