app/views/groups/index.html.haml

SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = $1  [["user_id", 2]]
---
        %th
      - @user.groups.each do |group|