app/views/groups/show.html.haml

        %th
      - @groups.transactions.each do |transaction|
        %tr
          %td= link_to transaction.name, group_transaction_path(transaction.group, transaction)
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."group_id" = $1  [["group_id", 17]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]