app/controllers/groups_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def show
    @groups = Group.find(params[:id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
  def edit
    @groups = Group.find(params[:id])

INSERT INTO "groups" ("group_name", "group_description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_name", "testing2"], ["group_description", "testing2\r\n"], ["created_at", "2020-02-29 22:03:03.951057"], ["updated_at", "2020-02-29 22:03:03.951057"]]
INSERT INTO "groups" ("group_name", "group_description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_name", "testing 2"], ["group_description", "testing2"], ["created_at", "2020-02-29 21:58:18.317305"], ["updated_at", "2020-02-29 21:58:18.317305"]]
---
  def create
    @groups = Group.new(group_params)
    @groups.users << current_user

    if @groups.save

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "email"], ["LIMIT", 1]]
UPDATE "groups" SET "group_name" = $1, "group_description" = $2, "updated_at" = $3 WHERE "groups"."id" = $4  [["group_name", "personal gmail edit"], ["group_description", "edit testing"], ["updated_at", "2020-03-03 16:37:49.624629"], ["id", 20]]
---
  def update
    @groups = Group.find(params[:id])
    @user = User.find_by(email: params[:users][:email])
    if(@user)
      @groups.users << @user
    end

    if @groups.update(group_user_params)

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 14]]
---
  def destroy
    @groups = Group.find(params[:id])
    @groups.destroy