app/controllers/groups_controller.rb

  def settle_up
    @group = Group.find(params[:group_id])
    @users = @group.users
    @transactions = @group.transactions

    @isowed = Hash.new
    @owes = Hash.new

    @users.each do |user| #for each user
      @total = 0
      if(!user.transactions.empty?) #if user has transactions
        @transactions.each do |trx| #for each transaction in the group
          if(user.transactions.exists?(trx.id)) #if the transaction is in the user's transactions
---
SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = $1  [["group_id", 9]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."group_id" = $1  [["group_id", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."group_id" = $1  [["group_id", 2]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."group_id" = $1  [["group_id", 4]]

  def update
    @groups = Group.find(params[:id])
    if(params[:users][:email] != "")
      @user = User.find_by(email: params[:users][:email])
      if(!(@groups.users.exists?(@user.id)) && !@user.nil?)
---
SELECT  1 AS one FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = $1 AND "users"."id" = $2 LIMIT $3  [["group_id", 11], ["id", nil], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = $1  [["group_id", 9]]