app/controllers/people_controller.rb

    def create
        @groups = Group.find(params[:group_id])
        @person = @groups.people.create(person_params)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "people" ("name", "email", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Elizabeth"], ["email", "elizabethchristman31@gmail.com"], ["group_id", 8], ["created_at", "2020-01-06 02:54:40.469759"], ["updated_at", "2020-01-06 02:54:40.469759"]]

    def destroy
        @groups = Group.find(params[:group_id])
        @person = @groups.people.find(params[:id])
        @person.destroy
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "people".* FROM "people" WHERE "people"."group_id" = $1 AND "people"."id" = $2 LIMIT $3  [["group_id", 8], ["id", 1], ["LIMIT", 1]]
DELETE FROM "people" WHERE "people"."id" = $1  [["id", 1]]