app/controllers/transactions_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
    def new
        @groups = Group.find(params[:id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
INSERT INTO "transactions" ("amount", "created_at", "updated_at", "name", "group_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", "10.0"], ["created_at", "2020-03-26 19:47:21.112688"], ["updated_at", "2020-03-26 19:47:21.112688"], ["name", "coffee"], ["group_id", 11]]
---
    def create
        @groups = Group.find(params[:group_id])
        @transactions = @groups.transactions.create(transaction_params)

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."group_id" = $1 AND "transactions"."id" = $2 LIMIT $3  [["group_id", 10], ["id", 4], ["LIMIT", 1]]
---
    def edit
        @groups = Group.find(params[:group_id])
        @transactions = @groups.transactions.find(params[:id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."group_id" = $1 AND "transactions"."id" = $2 LIMIT $3  [["group_id", 9], ["id", 10], ["LIMIT", 1]]
UPDATE "transactions" SET "amount" = $1, "updated_at" = $2 WHERE "transactions"."id" = $3  [["amount", "105.0"], ["updated_at", "2020-02-29 23:38:31.680889"], ["id", 8]]
---
    def update
        @groups = Group.find(params[:group_id])
        @transactions = @groups.transactions.find(params[:id])

        if @transactions.update(transaction_params)

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."group_id" = $1 AND "transactions"."id" = $2 LIMIT $3  [["group_id", 7], ["id", 8], ["LIMIT", 1]]
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 17]]
DELETE FROM "transactions" WHERE "transactions"."id" = $1  [["id", 8]]
---
    def destroy
        @groups = Group.find(params[:group_id])
        @transactions = @groups.transactions.find(params[:id])
        @transactions.destroy