app/controllers/transactions_controller.rb

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        @transactions = Transaction.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Elizabeth Christman"], ["LIMIT", 1]]
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."group_id" = $1 AND "transactions"."id" = $2 LIMIT $3  [["group_id", 2], ["id", 4], ["LIMIT", 1]]
---
    def update_users
        @transactions = Transaction.find(params[:transaction_id])
        @user = User.find_by(name: params[:users][:name])
        if(@user.nil?)
            @transactions.errors[:base] << "This user does not exist"
            render 'show'
            return
        end
        @amounts = @user.amounts

        @paid = params[:users][:paid]
        @proportion = params[:users][:proportion]

        if(@proportion.to_d > @transactions.amount) #check if proportion is higher than total
            @transactions.errors[:base] << "Expected amount cannot be more than transaction total"
            render 'show'
            return
        elsif(@paid.to_d > @transactions.amount) #check if paid is higher than total
            @transactions.errors[:base] << "User cannot pay more than transaction total"
            render 'show'
            return
        elsif(!@user.in? @transactions.group.users) #check if user is in group