app/views/transactions/_transaction.html.haml

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---

= link_to 'Edit Transaction', edit_group_transaction_path(transaction.group, transaction)