app/views/transactions/edit.html.haml

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  %div#navButtons
    = link_to 'Back', group_path(@transactions.group)