app/views/transactions/show.html.haml

    DinDiv
    = link_to 'Back', group_path(@transactions.group)
    = link_to 'Edit', edit_group_transaction_path(@transactions.group, @transactions)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

    %div#transactionInfo
        - @transactions.users.each do |user|
---
SELECT "users".* FROM "users" INNER JOIN "amounts" ON "users"."id" = "amounts"."user_id" WHERE "amounts"."transaction_id" = $1  [["transaction_id", 1]]