app/views/transactions/show.html.haml

    %div#navButtons
        = link_to 'Back', group_path(@transactions.group)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]